// 5. Домашнее задание к занятию «Пирамиды и деревья поиска»
// Задача 1. Вывод пирамиды на массиве
// Вам нужно реализовать на консоль функцию вывода целочисленной пирамиды, реализованной на массиве.

#include <iostream>

#include "printPyramid.h"





int main()
{
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    std::cout << "\nHello World!\n";
}
